{"name": "SendSpidertronToTheWest", "version": "0.0.8", "title": "SendSpidertronToTheWest", "author": "boernsen2", "factorio_version": "1.1", "dependencies": ["base"], "description": "This mod has been created for a project exploring the map's border in the west using spidertrons. It can be used to send the spidertron connected to the remote in hand to the west by a hotkey until it is stopped. The spidertron will move to one of three corridors and go westwards infinitely while continuously placing blueprints. The blueprint is a 100x1 landfill for the top/bottom corridors and a 100m dual rail with signals every 100m and landfill underneath for the middle corridor. Additionally, spidertrons can be send to a patrol_left or patrol_right 'corridor' causing them to commute on the middle corridor (y=476) between x=-640 and x=-999980, where the choice of patrol_left/right only determine to which direction they go first. Lastly, spidertrons can be added to a patrol scheduling list, which once started is processed every 10 minutes making the spidertrons from that list leave one by one to patrol_left (actually every 36905 ticks, which equals approx. 10km for a spidertron with two exos).\n\nThe following default shortcuts and console commands are available:\n\nShift + U : send/stop spidertron connected to remote in hand to top corridor (y = 425)\nShift + J : send/stop spidertron connected to remote in hand to middle corridor (y = 476)\nShift + M : send/stop spidertron connected to remote in hand to bottom corridor (y = 528)\nShift + O : send/stop spidertron connected to remote in hand to patrol_left (between -999980 and -640 in middle corridor)\nShift + P : send/stop spidertron connected to remote in hand to patrol_right (between -999980 and -640 in middle corridor)\nCtrl + O  : add spidertron connected to remote in hand to the scheduling list for patrol_left\n/clear_patrol_left_schedule : start the scheduling list for patrol_left\n/start_patrol_left_schedule : clear the scheduling list for patrol_left"}